#pragma once

#include <cassert>
#include <cstring>
#include <iomanip>
#include <iostream>
#include <memory>
#include <string>
#include <unordered_map>
#include "common.h"
#include "data_cache.h"
#include "physical_memory.h"
#include "pwc.h"
#include "tlb.h"

// Page Table Entry
struct PageTableEntry8B {
    UINT64 present : 1;   // Present bit
    UINT64 writable : 1;  // Writable bit
    UINT64 user : 1;      // User accessible
    UINT64 pfn : 52;      // Physical Frame Number (40 bits used)
    UINT64 unused : 9;    // Unused bits

    PageTableEntry8B() : present(0), writable(0), user(0), pfn(0), unused(0) {}
};

static_assert(sizeof(PageTableEntry8B) == 8, "PageTableEntry8B size mismatch!");

struct PageTableEntry4B {
    UINT32 present : 1;  // Present bit
    UINT32 controlBits : 23;
    UINT32 tinyPointer : 8;
};

static_assert(sizeof(PageTableEntry4B) == 4, "PageTableEntry4B size mismatch!");

struct PageTableEntry2B {
    UINT8 present : 1;      // Present bit
    UINT8 controlBits : 7;  // Control bits
    UINT8 tinyPointer : 8;
};

static_assert(sizeof(PageTableEntry2B) == 2, "PageTableEntry2B size mismatch!");

struct PageTableEntry1B {
    UINT8 present : 1;  // Present bit
    UINT8 controlBits : 1;
    UINT8 tinyPointer : 6;
};

static_assert(sizeof(PageTableEntry1B) == 1, "PageTableEntry1B size mismatch!");

struct PageTablePage {
    union {
        PageTableEntry8B entries8B[512];   // 8-byte entries
        PageTableEntry4B entries4B[1024];  // 4-byte entries
        PageTableEntry2B entries2B[2048];  // 2-byte entries
        PageTableEntry1B entries1B[4096];  // 1-byte entries
    } __attribute__((aligned(4096)));      // 4KB page size

    PageTablePage() {
        // fill with 0
        memset(this, 0, sizeof(PageTablePage));
    }
};

static_assert(sizeof(PageTablePage) == 4096,
              "DummyPageTablePage size mismatch!");

// Page Table (4-level) with PWCs and two-level TLB
class PageTable {
   private:
    std::unordered_map<UINT64, std::unique_ptr<PageTablePage>> pageTables_;
    UINT64 cr3_;                 // Page table base register (points to PGD)
    PhysicalMemory& physMem_;    // Reference to physical memory
    CacheHierarchy& dataCache_;  // Reference to data cache
    bool isPteCachable_;         // PTE cacheable flag
    // Two-level TLB
    TLB l1Tlb_;  // L1 TLB (smaller, faster)
    TLB l2Tlb_;  // L2 TLB (larger, slower)

    // page table set up
    const UINT64 pgdEntryNum_;
    const UINT64 pudEntryNum_;
    const UINT64 pmdEntryNum_;
    const UINT64 pteEntryNum_;

    const int pgdEntryWidth_ = 8;
    const int pudEntryWidth_;
    const int pmdEntryWidth_;
    const int pteEntryWidth_;

    const int pteIndexShift_;
    const int pmdShift_;
    const int pudShift_;
    const int pgdShift_;

